Repository: traductik-tao/-AFM_EN-FR
Catalog: omegat/project_save.tmx
Source language: en_gb
Languages: fr_fr

source: this was a short study compared
fr_fr: son trop court-terme, comparé

source: to be precise about the diagnosis leading
fr_fr: est donc d'être précis sur le diagnostic, afin d'obtenir

source: to be spliced into the collagen VI gene.
fr_fr: venant s'épisser sur le gène du collagène VI.

source: to building on this relationship
fr_fr: construire sur cette relation

source: to discuss the latest in myopathies.
fr_fr: des dernières avancées en myopathie.

source: to precise therapies for individual patients.
fr_fr: des thérapies précises pour chaque patient.

source: to the disease progression,
fr_fr: à la progression de la maladie,

source: to the level of the individual patients.
fr_fr: arrivent jusqu'à chaque patient.

source: to treating Duchenne muscular dystrophy,
fr_fr: pour le traitement de la dystrophie musculaire de Duchenne,

source: to try and find a common way of collaboration,
fr_fr: afin d'établir une méthode commune de collaboration,

source: two different approaches
fr_fr: deux approches différentes

source: two different gene-therapy based approaches.
fr_fr: deux approches différentes basées sur la thérapie génique.

source: was a way of combining exon skipping
fr_fr: était un moyen de combiner le saut d'exon

source: we have not stopped trying.
fr_fr: et que nous continuons nos efforts.

source: we just direct it to exon 2
fr_fr: nous le dirigeons simplement sur exon 2

source: we make a kind of dystrophin
fr_fr: nous faisons une sorte de dystrophine

source: when I was first in laboratory
fr_fr: quand j'étais en laboratoire

source: where nerve meets muscle.
fr_fr: à l'endroit où le nerf rencontre le muscle.

source: which are genetic disorders of muscles
fr_fr: Ce sont des désordres génétiques des muscles

source: which are severe types, also known as
fr_fr: Ce sont des types graves, également connus sous le nom

source: which is a deep intronic mutation,
fr_fr: qui est une mutation intronique profonde,

source: which may prove to be interesting but
fr_fr: qui pourraient s'avérer intéressants, mais

source: which need to be approached.
fr_fr: — une question à prendre en compte,

source: which really is one of the world's leading institutions for
fr_fr: qui est vraiment l'une des principales institutions du monde pour

source: which was thought to be
fr_fr: — dont la déficience était censée

source: who walk around making that type of dystrophin...
fr_fr: qui se promener à faire ce type de dystrophine ...

source: with Genethon and the Institute of Myology
fr_fr: avec Généthon et l'Institut de Myologie

source: with all leaders in this field,
fr_fr: avec tous les leaders de ce domaine,

source: with funding from the AFM long ago,
fr_fr: avec un financement de l'AFM il y a longtemps,

source: with supplementation of sialic acid,
fr_fr: de la supplémentation testée en acide sialique

source: with the AFM,
fr_fr: avec l'AFM,

source: won't show in a three-year time period
fr_fr: est quasi nulle sur une période de trois ans.

source: working with the agency that developed the Genethon.
fr_fr: travailler avec l'agence qui a développé le Généthon.

source: you get increased muscle growth, increased strength,
fr_fr: vous obtenez une croissance musculaire accrue, plus de tonus,
